### Terraform formatting: success
<details><summary>Expand...</summary>

```diff

```
</details>

### Terraform plan: success
<details><summary>Expand...</summary>

```HCL
google_project.project: Refreshing state... [id=projects/arikkfir]
google_service_account.gha-arikkfir-infrastructure: Refreshing state... [id=projects/arikkfir/serviceAccounts/gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_storage_bucket.arikkfir-devops: Refreshing state... [id=arikkfir-devops]
google_project_iam_member.gha-arikkfir-infrastructure-resourcemanager-projectIamAdmin: Refreshing state... [id=arikkfir/roles/resourcemanager.projectIamAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-infrastructure-compute-networkAdmin: Refreshing state... [id=arikkfir/roles/compute.networkAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-infrastructure-serviceusage-serviceUsageAdmin: Refreshing state... [id=arikkfir/roles/serviceusage.serviceUsageAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_organization_iam_member.kfirfamily-gha-arikkfir-infrastructure-resourcemanager-organizationViewer: Refreshing state... [id=468825984716/roles/resourcemanager.organizationViewer/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_organization_iam_member.kfirfamily-gha-arikkfir-infrastructure-iam-organizationRoleViewer: Refreshing state... [id=468825984716/roles/iam.organizationRoleViewer/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-infrastructure-browser: Refreshing state... [id=arikkfir/roles/browser/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-infrastructure-iam-serviceAccountAdmin: Refreshing state... [id=arikkfir/roles/iam.serviceAccountAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_storage_bucket_iam_member.arikkfir-devops-gha-arikkfir-infrastructure-storage-admin: Refreshing state... [id=b/arikkfir-devops/roles/storage.admin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_storage_bucket_iam_member.arikkfir-devops-gha-arikkfir-infrastructure-storage-objectAdmin: Refreshing state... [id=b/arikkfir-devops/roles/storage.objectAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_project_service.apis["logging.googleapis.com"]: Refreshing state... [id=arikkfir/logging.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=arikkfir/iam.googleapis.com]
google_project_service.apis["cloudbilling.googleapis.com"]: Refreshing state... [id=arikkfir/cloudbilling.googleapis.com]
google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=arikkfir/secretmanager.googleapis.com]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=arikkfir/cloudresourcemanager.googleapis.com]
google_project_service.apis["dns.googleapis.com"]: Refreshing state... [id=arikkfir/dns.googleapis.com]
google_project_service.apis["storage-component.googleapis.com"]: Refreshing state... [id=arikkfir/storage-component.googleapis.com]
google_project_service.apis["servicemanagement.googleapis.com"]: Refreshing state... [id=arikkfir/servicemanagement.googleapis.com]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=arikkfir/artifactregistry.googleapis.com]
google_project_service.apis["serviceusage.googleapis.com"]: Refreshing state... [id=arikkfir/serviceusage.googleapis.com]
google_project_service.apis["monitoring.googleapis.com"]: Refreshing state... [id=arikkfir/monitoring.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=arikkfir/compute.googleapis.com]
google_project_service.apis["bigquerystorage.googleapis.com"]: Refreshing state... [id=arikkfir/bigquerystorage.googleapis.com]
google_project_service.apis["container.googleapis.com"]: Refreshing state... [id=arikkfir/container.googleapis.com]
google_project_service.apis["storage-api.googleapis.com"]: Refreshing state... [id=arikkfir/storage-api.googleapis.com]
google_project_service.apis["containerregistry.googleapis.com"]: Refreshing state... [id=arikkfir/containerregistry.googleapis.com]
google_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=arikkfir/bigquery.googleapis.com]
google_project_service.apis["containerfilesystem.googleapis.com"]: Refreshing state... [id=arikkfir/containerfilesystem.googleapis.com]
google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=arikkfir/pubsub.googleapis.com]
google_project_service.apis["oslogin.googleapis.com"]: Refreshing state... [id=arikkfir/oslogin.googleapis.com]
google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=arikkfir/iamcredentials.googleapis.com]
google_service_account.config-connector: Refreshing state... [id=projects/arikkfir/serviceAccounts/config-connector@arikkfir.iam.gserviceaccount.com]
google_service_account.gke-node: Refreshing state... [id=projects/arikkfir/serviceAccounts/gke-node@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gke-node-logging-logWriter: Refreshing state... [id=arikkfir/roles/logging.logWriter/serviceAccount:gke-node@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gke-node-monitoring-metricWriter: Refreshing state... [id=arikkfir/roles/monitoring.metricWriter/serviceAccount:gke-node@arikkfir.iam.gserviceaccount.com]
google_service_account_iam_member.config_connector_workload_identity: Refreshing state... [id=projects/arikkfir/serviceAccounts/config-connector@arikkfir.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:arikkfir.svc.id.goog[cnrm-system/cnrm-controller-manager]]
google_compute_network.gke: Refreshing state... [id=projects/arikkfir/global/networks/gke]
google_compute_subnetwork.gke-subnet: Refreshing state... [id=projects/arikkfir/regions/europe-west3/subnetworks/gke-subnet-europe-west3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + description                 = "Primary cluster."
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "europe-west3-a"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "primary"
      + network                     = "https://www.googleapis.com/compute/v1/projects/arikkfir/global/networks/gke"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "arikkfir"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "https://www.googleapis.com/compute/v1/projects/arikkfir/regions/europe-west3/subnetworks/gke-subnet-europe-west3"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = true
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = true
            }

          + istio_config {
              + auth     = (known after apply)
              + disabled = (known after apply)
            }

          + kalm_config {
              + enabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = "gke-security-groups@kfirfamily.com"
        }

      + cluster_autoscaling {
          + autoscaling_profile = "OPTIMIZE_UTILIZATION"
          + enabled             = false

          + auto_provisioning_defaults {
              + image_type       = (known after apply)
              + min_cpu_platform = (known after apply)
              + oauth_scopes     = (known after apply)
              + service_account  = (known after apply)
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + identity_service_config {
          + enabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "gke-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "gke-services"
        }

      + logging_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]
        }

      + network_policy {
          + enabled  = (known after apply)
          + provider = (known after apply)
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + node_group        = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + spot              = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + ephemeral_storage_config {
              + local_ssd_count = (known after apply)
            }

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
            }

          + linux_node_config {
              + sysctls = (known after apply)
            }

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = (known after apply)
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + network_config {
              + create_pod_range    = (known after apply)
              + pod_ipv4_cidr_block = (known after apply)
              + pod_range           = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + spot              = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + ephemeral_storage_config {
                  + local_ssd_count = (known after apply)
                }

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                }

              + linux_node_config {
                  + sysctls = (known after apply)
                }

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + placement_policy {
              + type = (known after apply)
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + notification_config {
          + pubsub {
              + enabled = (known after apply)
              + topic   = (known after apply)
            }
        }

      + release_channel {
          + channel = "RAPID"
        }

      + resource_usage_export_config {
          + enable_network_egress_metering       = false
          + enable_resource_consumption_metering = true

          + bigquery_destination {
              + dataset_id = "cluster_resource_usage"
            }
        }

      + vertical_pod_autoscaling {
          + enabled = (known after apply)
        }

      + workload_identity_config {
          + workload_pool = "arikkfir.svc.id.goog"
        }
    }

  # google_container_node_pool.core-n2-custom-4-7168-pre will be created
  + resource "google_container_node_pool" "core-n2-custom-4-7168-pre" {
      + cluster                     = "primary"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west3-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "core-n2-custom-4-7168-pre"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "arikkfir"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config {
          + create_pod_range    = (known after apply)
          + pod_ipv4_cidr_block = (known after apply)
          + pod_range           = (known after apply)
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = "n2-custom-4-7168"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "gke-node@arikkfir.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 3
          + max_unavailable = 0
        }
    }

  # google_container_node_pool.work-n2-custom-4-5120-pre will be created
  + resource "google_container_node_pool" "work-n2-custom-4-5120-pre" {
      + cluster                     = "primary"
      + id                          = (known after apply)
      + initial_node_count          = 0
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west3-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "work-n2-custom-4-5120-pre"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "arikkfir"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "kfirs.com/workload-nodes" = "true"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n2-custom-4-5120"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "gke-node@arikkfir.iam.gserviceaccount.com"
          + taint             = [
              + {
                  + effect = "NO_EXECUTE"
                  + key    = "kfirs.com/workload-nodes"
                  + value  = "true"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 3
          + max_unavailable = 0
        }
    }

  # google_project_iam_member.gha-arikkfir-infrastructure-container-clusterAdmin will be created
  + resource "google_project_iam_member" "gha-arikkfir-infrastructure-container-clusterAdmin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com"
      + project = "arikkfir"
      + role    = "roles/container.clusterAdmin"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
</details>